Repository: 84000/data-translation-memory
Catalog: toh263-v3.tmx
Source language: bo
Languages: en

source: འཕགས་པ་ཡང་དག་པར་སྤྱོད་པའི་ཚུལ་ནམ་མཁའི་མདོག་གིས་འདུལ་བའི་བཟོད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། བམ་པོ་དང་པོ། སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: The Noble Great Vehicle Sūtra The Acceptance That Tames Beings with the Sky-Colored Method of Perfect Conduct Homage to all buddhas and bodhisattvas.

source: འདི་སྐད་བདག་གིས་ཐོས་པའི་དུས་གཅིག་ན།
en: Chapters 1–3 Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་བྱེད་པ་ཅན་ན་རྙོག་པ་སེལ་བ་ཞེས་བྱ་བའི་བྱེད་པ་ཅན་གྱི་གྲོང་རྡལ་དུ་སྣང་བ་འཕེལ་བ་ཞེས་བྱ་བའི་རི་ལ་དྲང་སྲོང་རྟ་རླུང་ཞེས་བྱ་བ་དཀའ་ཐུབ་ལ་གནས་པ་ན།
en: The Blessed One was residing in the Land of Activity. He was near the market town in the Land of Activity called Removing Impurities, on a mountain called Increasing Light, at the hermitage of the seer Wind Horse.

source: དགེ་སློང་གི་དགེ་འདུན་བརྒྱ་ཕྲག་ཕྱེད་དང་བཅུ་གསུམ་གྱི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་བཞིན་གཤེགས་པའི་སྤྱོད་ཡུལ་ལ་ཆགས་པ་མེད་པའི་ཡེ་ཤེས་ཀྱིས་རྣམ་པར་སྤྲུལ་པ།
en: He was surrounded by a great saṅgha of 1,250 monks and by bodhisattva great beings who had emanated in the domain of the thus-gone ones by means of their unattached wisdom.

source: ཚད་མེད་པའི་བྱམས་པ་ཆེན་པོའི་བྱིན་གྱི་རླབས་ཀྱི་སྟོབས་རྗེས་སུ་ཐོབ་པ།
en: All those bodhisattva great beings had developed the transformative power of immeasurable great love.

source: ཚད་མེད་པའི་སྙིང་རྗེ་ཆེན་པོས་སེམས་ཅན་གྱི་ཆུ་བོ་ཀུན་ཏུ་འཆང་བར་རྣམ་པར་སྤྲུལ་པ།
en: With their immeasurable great compassion, they emanated to sustain the flood of beings.

source: ཚད་མེད་པའི་དགའ་བའི་བྱིན་གྱིས་བརླབས་ཀྱི་སྟོབས་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ལ་བདེ་བའི་དྲན་པའི་ཆར་རབ་ཏུ་འབབ་པས་ཀུན་ཏུ་ངོམས་པ།
en: Through the transformative power of immeasurable joy, they showered down thoughts of comfort for all beings, satiating them.

source: ཚད་མེད་པའི་བཏང་སྙོམས་ཀྱི་ཡེ་ཤེས་ཀྱིས་ཆོས་ཐམས་ཅད་ནམ་མཁའ་དང་མཉམ་པར་འཇུག་པ་ལ་མཁས་པ།
en: Through the wisdom of immeasurable equanimity, they were skilled in engaging with all phenomena being the same as the sky.

source: ཆོས་ཀྱི་སྤྲིན་དང་། ལྷག་མཐོང་དང་། རིག་པ་དང་། ཡེ་ཤེས་ཀྱི་སྟོབས་ཀྱིས་མ་རིག་པའི་མུན་པ་ཆེན་པོ་རྣམ་པར་འཇིག་པ་ལ་མཁས་པ།
en: With the strength of clouds of Dharma, special insight, knowledge, and wisdom, they were skilled in clearing away the dense darkness of ignorance.

source: བསྡུ་བ་རྣམ་པ་བཞིས་སེམས་ཅན་རྣམས་ཆུ་བོ་བཞི་ལས་བསྒྲལ་བར་བྱ་བའི་ཡེ་ཤེས་དང་།
en: Through the four means of attracting disciples, they were endowed with the wisdom that can liberate beings from the four floods.

source: སེམས་ཅན་ཐམས་ཅད་ལ་མཚུངས་པར་སེམས་པའི་ཕྱིར་བྱམས་པ་དང་། ཁོང་ཁྲོ་བ་མེད་པས་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ལམ་ཡོངས་སུ་དག་པ།
en: Since they considered all beings as equal, they were loving, devoid of hostility, and had purified the path of the factors of awakening.

source: ཆོས་ཀྱིས་ཡང་དག་པར་འཇུག་པ།
en: They were genuinely engaged in the Dharma.

source: ཡེ་ཤེས་ཆེན་པོ་ལ་མཁས་པ།
en: They were experts in great wisdom.

source: འཇིག་རྟེན་ལ་མཆོག་གི་ལམ་ཡང་དག་པར་སྟོན་པ། །
en: They revealed the supreme path to the world.

source: སེམས་ཅན་རྣམ་པར་རྒྱས་ཤིང་དགེ་བའི་རྩ་བས་ཡོངས་སུ་སྲེད་པའི་ཆུ་བརྐམ་ཞིང་ཡེ་ཤེས་ཀྱི་ལས་ཀྱི་མཐའ་ལ་རབ་ཏུ་འཇུག་པ།
en: They brought prosperity to beings, had dried up the river of craving with their roots of virtue, and were engaged in the activity of wisdom.

source: མངོན་པར་ཤེས་པ་ཆེན་པོའི་ཡེ་ཤེས་རྣམ་པར་རྩེ་བ་མངོན་པར་ཤེས་པ་ཟླ་བ་ལྟ་བུ།
en: Their moon-like supernormal faculties were the play of their knowledge of the great supernormal faculties.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་མཚུངས་པར་ཤེས་པའི་བསམ་པ་མངོན་པར་ཡང་དག་པར་མགུ་བའི་ཕྱིར་ཐབས་ལ་མཁས་པ་འཕེལ་བ་ཡང་དག་པར་སྟོན་པ།
en: In order to bring them happiness, a wish that they know is the intent that all beings share, they displayed a vast array of skillful means.

source: ནམ་མཁའ་དང་མཚུངས་པའི་གཟུངས་ཀྱིས་ཚད་མེད་པའི་སྣོད་ཆོས་རིན་པོ་ཆེས་ཡོངས་སུ་བཀང་ཞིང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་ཕྱིར་སྐྱེ་བོ་ཐམས་ཅད་ཀྱི་ཉེ་བར་འཚོ་བ།
en: In order to fill immeasurable vessels with the precious Dharma using dhāraṇīs as vast in number to fill the sky, and because of their bodhisattva practice, they sustained all beings.

source: འཕགས་པའི་བདེན་པ་བཞིས་རྐང་པའི་ཤུགས་ཆེན་པོས་ཆོས་ཀྱི་ཚུལ་གྱི་ལམ་ཟབ་མོའི་རྗེས་སུ་ཞུགས་པ།
en: With the great strength of their own feet, they had followed the profound path of the Dharma, using the four noble truths.

source: མཚུངས་པའི་ཆོས་ཀྱིས་གཞན་གྱི་རྒོལ་བ་ཐམས་ཅད་ཚར་གཅོད་པ།
en: They subjugated all opponents with the Dharma of sameness.

source: བསྐལ་པ་བརྒྱ་སྟོང་གྲངས་མེད་པའི་མཐར་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐུག་པ་མེད་ཅིང་རྒྱུན་མ་བཅད་པའི་ཡོན་ཏན་ཐམས་ཅད་འབྱུང་བ།
en: They continuously manifested all the infinite qualities of bodhisattva conduct, which are attained after countless hundreds of thousands of eons of practice.

source: རླུང་དང་མཚུངས་པའི་སེམས་འཇིག་རྟེན་པ་དང་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་ཐམས་ཅད་ཀྱིས་གོས་པ་མེད་པ།
en: Like the wind, their minds were untainted by any mundane or supramundane qualities.

source: བག་ཆགས་ཐམས་ཅད་རྗེས་སུ་འབྲེལ་པའི་ཉོན་མོངས་པ་རབ་ཏུ་སྤངས་པ། ཚད་མེད་གྲངས་མེད་པའི་ཏིང་ངེ་འཛིན་དང་། གཟུངས་དང་། བཟོད་པས་རྣམ་པར་རྩེ་བ་ལ་མཁས་པ་ཤ་སྟག་ལ་འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་རྟ་དང་གླང་པོ་ཆེ་མི་དཀར་བ་ཞེས་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རི་རབ་ཀུན་ཏུ་སྣང་བ་ཞེས་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རི་རབ་ཟླ་བ་ཞེས་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་བསྒྱིངས་པ་མི་ཟད་པ་ཞེས་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཡེ་ཤེས་དཔལ་ཞེས་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་མིག་སྔོན་པོ་ཞེས་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ངུར་སྨྲིག་སེང་གེ་སྒྲ་འབྱིན་ཅེས་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ནོར་གྱི་འོད་ཀྱི་ཚོགས་ཞེས་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རི་རབ་མཚམས་ཞེས་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྒྱལ་མཚན་རྣམ་པར་སྤྲུལ་པའི་དབྱངས་ཞེས་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་གློག་གི་ཕུང་པོ་ཞེས་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཡོན་ཏན་གྱི་གཟི་བརྗིད་དྲི་མ་མེད་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རི་རབ་སྟོབས་ཀུན་ཏུ་རྒྱས་པ་ཞེས་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་གཏོགས་འདོད་མཐུ་བོ་ཆེ་ཞེས་བྱ་བ་དང་།
en: They had abandoned the afflictions associated with all the habitual tendencies, and they were experts in reveling in immeasurable and countless absorptions, retentions, and acceptances.

source: བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་དང་། དེ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སྟོང་ཕྲག་བཅུ་དང་། སྔོན་དུ་འགྲོ་བ་དྲང་སྲོང་རྟ་རླུང་དང་། དྲང་སྲོང་སྟོང་ཕྲག་སུམ་ཅུ་དང་། ལྷ་བྲན་བརྒྱ་སྟོང་ཕྲག་བཅོ་བརྒྱད་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཡོངས་སུ་བསྐོར་ནས་ལྷན་ཅིག་ཏུ་འཁོད་དོ། །
en: These ten thousand bodhisattvas—which included the bodhisattvas Black Elephant Stallion, All-Illuminating Sumeru, Moon of Sumeru, Gaping Maw, Jñānaśrī, Blue Eyes, Roar of the Saffron Lion, Luminous Heap of Jewels, Boundary of Sumeru, Melody of the Emanated Banner, Mass of Lightning, Guṇatejas, Stainless King, Expansive Power of Sumeru, Powerful Wish for Belonging, and Maitreya—along with thirty thousand seers led by the seer Wind Horse as well as 1,800,000 temple servants, were sitting together around the Blessed Buddha.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ལེགས་པར་འོངས་པ་ལ་བཀའ་སྩལ་པ། ལེགས་པར་འོངས་པ་དེ་བཞིན་གཤེགས་པའི་སེང་གེའི་ཁྲི་བཤམས་པ་དེ་ལ་བདག་འདུག་སྟེ། ཉན་ཐོས་རྣམས་ལ་ཉན་ཐོས་ཀྱི་གཏམ་སྨྲ་བར་འགྱུར་རོ། །
en: The Blessed One said to Venerable Svāgata, “Svāgata, while sitting on this lion throne that has been provided for the Thus-Gone One, I will deliver a hearer’s discourse to the hearers.”

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་ནོ་ཞེས་གསོལ་པ་དང་།
en: “Very well, Blessed One!”

source: ཚེ་དང་ལྡན་པ་ལེགས་པར་འོངས་པ་ཕྱིར་མཉན་ཏེ། །བཅོམ་ལྡན་འདས་ཀྱི་ཕྱིར་ཕོ་བྲང་ཟླུམ་པོ་བྱས་པར་གྱུར་ཏོ། །
en: replied Svāgata, heeding the Blessed One, and then he built a round pavilion for him.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཁོར་ཐམས་ཅད་དང་ལྡན་པ་ལ་རྣམ་པར་ཀུན་ཏུ་བལྟས་ཏེ། ཕོ་བྲང་ཟླུམ་པོར་བཤམས་པ་ཉིད་དུ་བཞུགས་སོ། །
en: The Blessed One then sat in the round pavilion that had been built for him and he beheld the entire assembly.

source: དེ་ནས་དགེ་སློང་གཞན་དག་ཀྱང་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་བྱས་ནས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་ཏེ། ཕྱག་འཚལ་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: At that point, the other monks stood up, draped their shawls over one shoulder, prostrated toward the Blessed One with their palms joined, and asked him, “Blessed One, what are these ‘worlds’ you speak of?

source: བཅོམ་ལྡན་འདས་འཇིག་རྟེན་ཞེས་བགྱི་བ་བཙུན་པ་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་ཞེས་བགྱི་བ་ནི་གང་ལགས།
en: Respected Blessed One, what are these ‘worlds’ you speak of?

source: དེ་བཞིན་གཤེགས་པས་འཇིག་རྟེན་དུ་བཏགས་པས་བཏགས་པ་ནི་ཇི་ལྟ་བུ་ལགས། དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: How is it that the Thus-Gone One names them by designating them as worlds?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །དགེ་སློང་དག་འཇིག་རྟེན་འཇིག་རྟེན་ཞེས་བྱ་བ་དང་། དེ་དེ་བཞིན་གཤེགས་པས་འཇིག་རྟེན་དུ་བཏགས་པས་བཏགས་པ་ནི་ཇི་ཙམ་ཞེས་དགེ་སློང་ཁྱོད་དེ་སྐད་འདྲིའམ།
en: The Blessed One replied, “Monks, are you asking how many worlds there are that are known as worlds and how many the Thus-Gone One has named by designating them as worlds?”

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་ནོ། །
en: “Yes, Blessed One.”

source: དེའི་ཕྱིར་དགེ་སློང་ཁྱོད་ལེགས་པར་ཉོན་ལ་ཤིན་ཏུ་ཡིད་ལ་ཟུང་ཤིག་དང་ངས་བཤད་དོ། །
en: “Monks, listen carefully, pay attention, and I will explain.”

source: བཙུན་པ་དེ་བཞིན་ནོ་ཞེས་གསོལ་ཏེ།
en: “We shall, Venerable One!”

source: དགེ་སློང་དེ་བཅོམ་ལྡན་འདས་ལ་ཕྱིར་ཉན་པ་དང་།
en: replied the monks, and they listened to the Blessed One.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །དགེ་སློང་འཇིག་རྟེན་ཞེས་བྱ་བ་ནི་འཇིག་རྟེན་རྣམ་པ་གཉིས་ཏེ།
en: The Blessed One then said to them, “Monks, there are two types of worlds: the world that is a vessel and the world of compounded phenomena.

source: སྣོད་ཀྱི་འཇིག་རྟེན་དང་། འདུ་བྱེད་ཀྱི་འཇིག་རྟེན་ནོ། །དགེ་སློང་དེ་ལ་སྣོད་ཀྱི་འཇིག་རྟེན་ནི་གང་། འདུ་བྱེད་ཀྱི་འཇིག་རྟེན་ནི་གང་ཞེ་ན།
en: Monks, what is the world that is a vessel, and what is the world of compounded phenomena?

source: སའི་ཁམས་དང་། ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་ཇི་ཙམ་པ་ནི་སྣོད་ཅེས་བྱའོ། །
en: All the elements of earth, water, fire, and wind are referred to as vessels.

source: དགེ་སློང་དེ་ལ་ནང་གི་སའི་ཁམས་ཡོད་དེ།
en: Monks, among those, there is the internal earth element.

source: དགེ་སློང་དེ་ལ་ནང་གི་སའི་ཁམས་གང་ཞེ་ན། གང་ནང་གི་སྲ་བའི་སྲ་བ་ཉིད་ཟིན་པ་ནི་འདི་ལྟ་སྟེ།
en: Monks, what is the internal earth element?

source: རུས་པ་དང་། སེན་མོ་དང་། སོའི་བར་དུ་སྟེ། འདི་དག་ནི་ནང་གི་སའི་ཁམས་ཞེས་བྱའོ། །
en: Everything internal that has the characteristic of solidity—bones, nails, teeth, and so forth—is referred to as the internal earth element.

source: དེ་ལ་ཕྱི་རོལ་གྱི་སའི་ཁམས་གང་ཞེ་ན། གང་ལུས་ཀྱི་ཕྱི་རོལ་གྱི་སའི་ཁམས་ནི་འདི་ལྟ་སྟེ། འགྲོན་བུ་དང་། གསེར་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་། བཻདཱུརྱ་དང་། དུང་དང་།
en: What is the external earth element?

source: རྡོ་དང་། བྱི་རུ་དང་། དངུལ་དང་། ས་ལེ་སྦྲམ་དང་། གྲམ་བུ་དང་། གསེག་མ་དང་། གྱོ་མོ་དང་། ཤིང་དང་།
en: Everything outside the body that is made of the earth element—cowrie shells, gold, jewels, pearls, beryl, conch shells, stones, coral, silver, fine gold, river rocks, pebbles, gravel, trees, grass, medicinal plants, dust, and so forth—is referred to as the external earth element.

source: རྩྭ་དང་། སྨན་དང་། ཕྱག་དར་དང་། འདི་དག་ནི་ཕྱི་རོལ་གྱི་སའི་ཁམས་ཞེས་བྱའོ། །ཆུའི་ཁམས་གང་ཞེ་ན།
en: What is the water element?

source: ཕྱི་རོལ་གྱི་ཆུའི་ཁམས་ཡོད། ནང་གི་ཆུའི་ཁམས་ཀྱང་ཡོད་དེ།
en: There is an external water element and there is an internal water element.

source: དེ་ལ་ནང་གི་ཆུའི་ཁམས་གང་ཞེ་ན། ལུས་འདི་ལ་ཆུ་དང་། ཆུའི་ཁམས་ཀྱི་མཁྲིས་པ་དང་། བད་ཀན་དང་། རྣག་དང་།
en: What is the internal water element?

source: ཁྲག་དང་། གླད་པ་དང་། གླད་རྒྱས་དང་། མཆིལ་མ་དང་། རྔུལ་དང་། ངར་སྣབས་དང་། སྣབས་དང་། རྒྱུངས་པ་དང་། རྐང་དང་། གཅིན་ཡོད་པ་ཀུན་ཏུ་ལེན་པ་འདི་ནི་ནང་གི་ཆུའི་ཁམས་ཞེས་བྱའོ། །
en: Everything related to water and the water element in the body—bile, phlegm, pus, blood, brain, veins, saliva, tears, mucus, snot, marrow, bone fluids, and urine—is referred to as the internal water element.

source: དེ་ལ་ཕྱི་རོལ་གྱི་ཆུའི་ཁམས་གང་ཞེ་ན། གང་ལུས་ཀྱི་ཕྱི་རོལ་གྱི་ཆུའི་ཁམས་ནི་འདི་ལྟ་སྟེ། ཆུ་དང་། ཆུའི་ཁམས་ཀྱི་སྣུམ་པ་དང་། འོ་མ་དང་། ཞོ་དང་། དར་བ་དང་། བུ་རམ་དང་། ཤིང་གི་རོ་དང་།
en: What is the external water element?

source: ཆང་དང་། རྩབ་མོ་དང་། བུ་རམ་ཆང་དང་། མེ་ཏོག་ཆང་དང་། ལུས་ཀྱི་ཕྱི་རོལ་གྱི་ཆུའི་ཁམས་ཇི་ཙམ་པ་ཀུན་དུ་ལེན་པ་འདི་ནི་ཕྱི་རོལ་གྱི་ཆུའི་ཁམས་སོ། །
en: Everything related to water and the water element outside the body—oil, milk, curd, buttermilk, molasses, tree sap, fermented drinks, gruel, sweetened beer, and wine made of flowers—is referred to as the external water element.

source: དེ་ལ་ནང་གི་མེའི་ཁམས་གང་ཞེ་ན།
en: What is the internal fire element?

source: ལུས་འདི་ལ་གང་སྐྱེ་བོའི་མདོག་གི་དྲོ་བ་ཀུན་ཏུ་ལེན་པ་དེས་ལུས་འདི་དྲོ་བ་ཉིད་དུ་བ་དང་། གདུངས་པ་དང་། རིམས་དང་། ཡོངས་སུ་ཚིག་པ་དང་། དེས་ཟོས་པ་དང་། འཐུངས་པ་དང་། འཆོས་པ་དང་། མྱངས་པ་དེའི་ཡང་དག་པར་ཡོངས་སུ་སྨིན་པར་འགྱུར་བ་འདི་ནི་ནང་གི་མེའི་ཁམས་ཞེས་བྱའོ། །
en: Everything in the body related to heat that lends beings their complexion; that causes the body to be hot, to steam; that causes inflammation, fever, and burning; and that digests what one has eaten, drunk, chewed, and tasted is referred to as the internal fire element.

source: དེ་ལ་ཕྱི་རོལ་གྱི་མེའི་ཁམས་གང་ཞེ་ན། གང་མེའི་གདུང་བ་དང་། ཉི་མའི་གདུང་བ་དང་།
en: What is the external fire element?

source: ནོར་བུའི་གདུང་བ་དང་། འབྲུ་དང་། སྨན་དང་། ཤིང་དང་། རྩྭའི་དྲོ་བ་དང་།
en: The heat of a fire, the sun, and precious gems, as well as the heat produced by grains, medicinal plants, trees, grass, dung, and dust, are referred to as the external fire element.

source: ལྕི་བའི་དྲོ་བ་དང་། ཕྱག་དར་གྱི་དྲོ་བ་དང་། འདི་དག་ནི་ཕྱི་རོལ་གྱི་མེའི་ཁམས་ཞེས་བྱའོ། །དེ་ལ་ནང་གི་རླུང་གི་ཁམས་གང་ཞེ་ན། གང་ལུས་འདི་ལ་གྱེན་དུ་རྒྱུ་བའི་རླུང་དང་།
en: What is the internal wind element?

source: ཐུར་དུ་རྒྱུ་བའི་རླུང་དང་། མ་ཞུ་བའི་རླུང་དང་། ཡན་ལག་དང་། ཉིང་ལག་ཏུ་རྒྱུ་བའི་རླུང་དང་། འདི་ནི་ནང་གི་རླུང་རྣམས་ཞེས་བྱའོ། །
en: The upward-moving winds, the downward-moving winds, the winds related to indigestion, and the winds moving in all the limbs that are possessed by the body are referred to as the internal wind element.

source: དེ་ལ་ཕྱི་རོལ་གྱི་རླུང་གང་ཞེ་ན། གང་ཕྱི་རོལ་ཏུ་ཡང་དག་པར་རྒྱུ་བའི་རླུང་དང་། རྣམ་པར་རྒྱུ་བའི་རླུང་དང་།
en: What is the external wind element?

source: གྱེན་དུ་རྒྱུ་བ་དང་། གྲང་བ་དང་། དྲོ་བའི་དམུ་རླུང་ཕྱེད་པ་མང་པོ་དང་། ས་འཛིན་པའི་རླུང་དང་། ཕྱི་རོལ་གྱི་རླུང་གི་ཁམས་གང་ཡང་རུང་བ་འདི་ནི་ཕྱི་རོལ་གྱི་རླུང་གི་ཁམས་ཞེས་བྱ་སྟེ།
en: Any external wind that swirls together, that spreads out, or that moves upward; the many harmful cold and hot winds that blow constantly; the winds that support the earth; and everything else related to the external wind element are referred to as the external wind element.

source: དེ་ལྟར་ཕྱི་དང་ནང་གི་འབྱུང་བ་ཆེན་པོ་བཞི་པོ་འདི་ནི་སྣོད་ཀྱི་འཇིག་རྟེན་ཞེས་བྱའོ། །
en: In that way, those four external and internal great elements are known as the world that is a vessel.

source: འདི་གང་གི་སྣོད་ཅེ་ན།
en: “Of what are they vessels?

source: ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔའི་སྣོད་དོ། །
en: They are the vessels of the five aggregates that are the basis of grasping.

source: དགེ་སློང་དག་ཕྱི་དང་ནང་གི་འབྱུང་བ་ཆེན་པོ་བཞི་པོ་འདི་དག་ལ་གང་མོས་པའམ། དགའ་བའམ། བྱམས་པའམ། ཆགས་པའམ། རྒྱ་ཆེ་བའམ། ང་ཡིར་བྱ་བའམ། བདག་གིར་བྱ་བ་དེ་ཐམས་ཅད་སྤང་བར་བྱའོ་ཞེས་སོ་སོར་བསླབ་པར་བྱའོ། །གང་ལ་ལ་འདས་པ་དང་།
en: Monks, you should train to abandon all sense of interest in, delight in, love for, attachment to, the greatness of, possession of, and ownership of the four external and internal great elements.

source: མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་ཕྱི་དང་ནང་གིའམ། ཆེ་བའམ། ཕྲ་བའམ། ངན་པའམ།
en: You should train in that manner with respect to all the four great elements of the past, present, and future, whether they are external or internal, big, small, bad, good, far, or near.

source: བཟང་བའམ། གང་རིང་བའམ། གང་ཉེ་བའམ། འབྱུང་བ་ཆེན་པོ་བཞི་པོ་དེ་ཐམས་ཅད་དེ་བཞིན་དུ་སོ་སོར་བསླབ་པར་བྱའོ། །གང་ལ་ལ་འབྱུང་བ་ཆེན་པོ་བཞི་པོ་དེ་དག་ནི་བདག་གི་མ་ཡིན།
en: You should regard those four great elements with correct insight and conclude, ‘They do not belong to a self, a self does not belong to them, and they are not a self.’

source: བདག་ཀྱང་དེའི་མ་ཡིན། དེ་ཡང་བདག་མ་ཡིན་ནོ་ཞེས་དེ་ལྟར་དེ་བཞིན་དུ་ཡང་དག་པའི་ཤེས་རབ་ཀྱིས་ཇི་ལྟ་བ་བཞིན་དུ་བལྟ་བར་བྱའོ། །དགེ་སློང་དག་དགེ་སློང་གང་ལ་ལ་འབྱུང་བ་ཆེན་པོ་བཞི་པོ་འདི་དག་ལ་དེ་བཞིན་དུ་ཡང་དག་པའི་ཤེས་རབ་ཀྱིས་ཤིན་ཏུ་བརྟན་པར་བྱེད་དོ། །
en: Monks, any monk who regards the four great elements in that way establishes them using correct insight.

source: ཤིན་ཏུ་ཡིད་ལ་བྱས་པའི་དགེ་སློང་དེ་སྲེད་པ་དང་། རྒུད་པ་དང་། ལུས་ཀྱི་སྦྱོར་བའི་རྒྱུན་གཅོད་ཅིང་སྡུག་བསྔལ་གྱི་མཐར་བྱེད་པ་སྟེ།
en: A monk who is extremely focused severs the stream of craving, weakness, and physical fetters, and puts an end to suffering.

source: དགེ་སློང་དག་འདི་ནི་སྣོད་ཀྱི་འཇིག་རྟེན་ནོ། །
en: Monks, this was the world that is a vessel.

source: དགེ་སློང་དག་དེ་ལ་འདུ་བྱེད་ཀྱི་འཇིག་རྟེན་གང་ཞེ་ན།
en: “Monks, what is the world of compounded phenomena?

source: ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་ནི་འདུ་བྱེད་ཅེས་བྱའོ། །
en: The five aggregates that are the basis of grasping are known as formations.

source: ལྔ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are those five?

source: གཟུགས་ཉེ་བར་ལེན་པའི་ཕུང་པོ་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་།
en: The aggregates of form, feeling, perception, formation, and consciousness.

source: འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཉེ་བར་ལེན་པའི་ཕུང་པོ་སྟེ། དགེ་སློང་དག་འདི་ནི་འདུ་བྱེད་ཀྱི་འཇིག་རྟེན་ནོ། །
en: Monks, this is the world of compounded phenomena.

source: དགེ་སློང་དག་སེམས་ཅན་ཇི་ཙམ་པ་གང་སེམས་ཅན་གྱི་བསྡུ་བས་ཡང་དག་པར་བསྡུས་པ་དེ་ཐམས་ཅད་ཕུང་པོ་འདི་དག་གིས་བསྡུས་པ་དང་། ལྡན་པ་འདི་ནི་འདུ་བྱེད་ཀྱི་འཇིག་རྟེན་ཞེས་བྱའོ། །
en: Monks, the world of compounded phenomena refers to those beings that possess and are composed of these aggregates, all of whom are included in the category of beings.

source: དགེ་སློང་དག་ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་པོ་དེ་ལ་གང་མོས་པའམ། །དགའ་བའམ། བྱམས་པའམ། ཆགས་པའམ། རྒྱ་ཆེ་བའམ། ང་ཡིར་བྱ་བའམ། བདག་གིར་བྱ་བ་དེ་ཐམས་ཅད་སྤང་བར་བྱའོ་ཞེས་སོ་སོར་བསླབ་པར་བྱའོ། །གང་ཅུང་ཟད་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའམ། ཕྱིའི་འམ། ནང་གིའམ། ཆེ་བའམ། ཕྲ་བའམ།
en: Monks, you should train to abandon all sense of interest in, delight in, love for, attachment to, the greatness of, possession of, and ownership of the five aggregates that are the basis of grasping.

source: ངན་པའམ། བཟང་བའམ། གང་རིང་བ་འམ། གང་ཉེ་བའི་གཟུགས་དེ་ཐམས་ཅད་བདག་གི་མ་ཡིན། བདག་ཀྱང་དེའི་མ་ཡིན། དེ་ཡང་བདག་མ་ཡིན་ནོ་ཞེས་དེ་ལྟར་དེ་བཞིན་དུ་ཡང་དག་པའི་ཤེས་རབ་ཀྱིས་ཇི་ལྟ་བ་བཞིན་དུ་བལྟ་བར་བྱའོ། །གང་ལ་ལ་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའམ། ཕྱིའི་འམ། ནང་གིའམ། ཆེ་བའམ། ཕྲ་བའམ། ངན་པའམ། བཟང་བའམ།
en: You should regard all the past, present, and future forms—whether they are external or internal, and whether they are big, small, bad, good, far, or near—with correct insight and conclude, ‘They do not belong to a self, a self does not belong to them, and they are not a self.’

source: གང་རིང་བའམ། གང་ཉེ་བ་ཚོར་བ་དང་། གང་ལ་ལ་འདུ་ཤེས་དང་། གང་ལ་ལ་འདུ་བྱེད་དང་། གང་ཅུང་ཟད་རྣམ་པར་ཤེས་པ་དེ་ཐམས་ཅད་ནི་བདག་གི་མ་ཡིན།
en: Similarly, you should regard all the past, present, and future feelings, perceptions, formations, and consciousnesses—whether they are external or internal, and whether they are big, small, bad, good, far, or near—with correct insight and conclude, ‘They do not belong to a self, a self does not belong to them, and they are not a self.’

source: བདག་ཀྱང་དེའི་མ་ཡིན། དེ་བདག་མ་ཡིན་ནོ་ཞེས་དེ་ལྟར་དེ་བཞིན་དུ་ཡང་དག་པའི་ཤེས་རབ་ཀྱིས་ཇི་ལྟ་བ་བཞིན་དུ་བལྟ་བར་བྱ་བ་འདི་ནི་དགེ་སློང་དག་སྣོད་ཀྱི་འཇིག་རྟེན་དང་འདུ་བྱེད་ཀྱི་འཇིག་རྟེན་ཞེས་བྱའོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་སྣང་བ་འཁོར་དེར་འདུས་པར་གྱུར་ཏེ་འདུག་པ་དེས་བྱང་ཆུབ་སེམས་དཔའ་ཕུང་པོ་རྣམ་པར་འཇིག་པ་ལ་སྨྲས་པ།
en: Monks, this is what is meant by the world that is a vessel and the world of compounded phenomena.”

source: ཚེ་དང་ལྡན་པ་ཕུང་པོ་རྣམ་པར་འཇིག་པ་བཅོམ་ལྡན་འདས་ཀྱིས་ཕུང་པོ་ལྔ་པོ་འདི་འཇིག་རྟེན་དུ་བསྟན་པ་ནི་འདི་ལྟ་སྟེ། གཟུགས་ཀྱི་ཕུང་པོ་དང་། ཚོར་བའི་ཕུང་པོ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་།
en: Then the bodhisattva Samantāloka, who was present in the assembly, said to the bodhisattva Destroyer of Aggregates, “Venerable Destroyer of Aggregates, the five aggregates that the Blessed One taught within the world are the aggregates of form, feeling, perception, formation, and consciousness.

source: རྣམ་པར་ཤེས་པའི་ཕུང་པོའོ། །ཚེ་དང་ལྡན་པ་ཕུང་པོ་ལྔ་པོ་དེ་དག་ནི་ཇི་ལྟ་བུ།
en: Venerable One, how is it that those are the five aggregates?

source: གཟུགས་ཀྱི་ཕུང་པོ་ནི་གང་།
en: What is the aggregate of form?

source: འདོད་པའི་ཁམས་མིག་དང་གཟུགས་ཀྱི་འདོད་ཆགས་དང་བྲལ་བ་ཡང་དག་པར་གཞོལ་བ་དང་། རྣ་བ་དང་།
en: Is there a freedom from attachment related to form associated with the eyes of the desire realm?

source: སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་ཀྱང་མིག་དང་། གཟུགས་ཀྱི་འགོག་པ་ཡང་དག་པར་གཞོལ་བ་ཞིག་གམ།
en: Is there a cessation of form associated with the ears, nose, tongue, body, and mind, as well as the eyes?

source: གཟུགས་དང་། གཟུགས་མེད་པའི་ཁམས་ཀྱི་མིག་དང་། གཟུགས་ཀྱི་འདོད་ཆགས་དང་བྲལ་བ་ཡང་དག་པར་གཞོལ་བ་དང་།
en: Is there a freedom from attachment related to form that is associated with the eyes of the form and formless realms?

source: དེ་བཞིན་དུ་རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། །ལུས་དང་ཡིད་ཀྱི་མིག་དང་། གཟུགས་ཀྱི་འདོད་ཆགས་དང་བྲལ་བས་ཡང་དག་པར་གཞོལ་བ་ནི་གང་།
en: Is there a freedom from attachment related to form that is associated with the ears, nose, tongue, body, and mind, as well as the eyes?

source: ཅི་གཟུགས་ཀྱི་ཕུང་པོ་འདོད་པའི་ཁམས་མིག་དང་། གཟུགས་ཀྱི་འདོད་ཆགས་དང་བྲལ་བ་ཡང་དག་པར་གཞོལ་བ་དང་།
en: Is there a freedom from attachment related to form that is associated with the aggregate of form and the eyes of the desire realm?

source: རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་ཡིད་ཀྱང་མིག་དང་གཟུགས་ཀྱི་འདོད་ཆགས་དང་བྲལ་བ་ཡང་དག་པར་གཞོལ་བ་དང་།
en: Is there a freedom from attachment related to form that is associated with the ears, nose, tongue, body, and mind, as well as the eyes?

source: གཟུགས་དང་། གཟུགས་མེད་པའི་ཁམས་མིག་དང་། གཟུགས་ཀྱི་འདོད་ཆགས་དང་བྲལ་བ་ཡང་དག་པར་གཞོལ་བའམ།
en: Is there a freedom from attachment related to form that is associated with the eyes of the form and formless realms?

source: འོན་ཏེ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་འདོད་པའི་ཁམས་མིག་དང་། གཟུགས་ཀྱི་འདོད་ཆགས་དང་བྲལ་བ་ཡང་དག་པར་གཞོལ་བ་དང་།
en: Is there a freedom from attachment related to form that is associated with the feelings, perceptions, formations, and consciousnesses, as well as the eyes of the desire realm?

source: གཟུགས་དང་གཟུགས་མེད་པའི་ཁམས་མིག་དང་། གཟུགས་ཀྱི་འདོད་ཆགས་དང་བྲལ་བ་ཡང་དག་པར་གཞོལ་བའམ།
en: Is there a freedom from attachment related to form that is associated with the eyes of the form and formless realms?

source: ཅི་འདས་པ་གཟུགས་ཀྱི་ཕུང་པོའམ།
en: “What about the past aggregate of form?

source: མིག་དང་། གཟུགས་ཀྱི་འདོད་ཆགས་དང་བྲལ་བ་ཡང་དག་པར་གཞོལ་བ་དང་། རྣ་བ་དང་། སྣ་དང་ལྕེ་དང་།
en: Is there a freedom from attachment related to the past aggregate of form that is associated with the eyes?

source: ལུས་དང་། ཡིད་ནས་མིག་གི་བར་དུའམ། གཟུགས་དང་། གཟུགས་མེད་པའི་ཁམས་མིག་དང་། གཟུགས་ཀྱི་འདོད་ཆགས་དང་བྲལ་བ་ཡང་དག་པར་གཞོལ་བ་ཞིག་གམ།
en: Is there a freedom from attachment related to past forms that is associated with the ears, nose, tongue, body, mind, and eyes, as well as the eyes of the form and formless realms?

source: འོན་ཏེ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡང་དག་པར་གཞོལ་བ་ཞིག་གམ།
en: Is there one that is associated with feeling, perception, formation, and consciousness?

source: འོན་ཏེ་ད་ལྟར་བྱུང་བ་གཟུགས་ཀྱི་ཕུང་པོའམ།
en: What about the present aggregate of form?

source: མིག་དང་གཟུགས་ཀྱི་འདོད་ཆགས་དང་བྲལ་བ་དང་།
en: Is there a freedom from attachment related to present forms that is associated with the eyes?

source: རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་ཀྱང་གཟུགས་དང་གཟུགས་མེད་པའི་མིག་ནས་ཡིད་ཀྱི་བར་དུ་ཡང་དག་པར་གཞོལ་བ་ཞིག་གམ།
en: Is there a freedom from attachment related to present forms that is associated with the ears, nose, tongue, body, and mind, as well as with the eyes, up to the mind of the form and formless realms?

source: འོན་ཏེ་ཚོར་བ་ནས་ཡིད་ཀྱི་བར་དུའམ། འོན་ཏེ་མ་འོངས་པ་གཟུགས་ཀྱི་ཕུང་པོའམ།
en: What about the future aggregate of form?

source: དེ་རྣ་བ་ནས་ཡིད་ཀྱི་བར་དུ་ཡང་དག་པར་གཞོལ་བ་ཞིག་གམ།
en: Is there one that is associated with everything from the nose and ears up to the mind?

source: འོན་ཏེ་ཚོར་བ་ནས་ཡིད་ཀྱི་བར་དུའམ།
en: How about everything from feeling up to the mind?”
